---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.ConnectorFailures.FittingMustBeOnDuctWarn
source: html/9d54f60c-c4d2-7a5b-159c-c3a8c513df73.htm
---
# Autodesk.Revit.DB.BuiltInFailures.ConnectorFailures.FittingMustBeOnDuctWarn Property

The [Tap] must be attached to duct.

## Syntax (C#)
```csharp
public static FailureDefinitionId FittingMustBeOnDuctWarn { get; }
```